use crate::game::{Action, GameState, Location};

pub fn get_description(location: &Location) -> &'static str {
    match location {
        Location::Entrance => "Ты стоишь перед входом в древнее подземелье. 
            \rТемнота поглощает свет факела. На стене — надпись: 'Только достойные 
            \rпройдут дальше'.",
        Location::DarkCave => "Тебя обволакивает давящая темнота. 
            \rФакел способен осветить лишь пространство в метре от тебя.
            \rНо даже в такой темноте тебе удается разглядеть три прохода...",
        Location::TrapCorridor => "Ты оказываешься в узком корридоре. 
            \rНа стенах торчит множество ножей, вил и других острых вещей. 
            \rНа полу отчетливл видно, что некоторые камни выше других, как будто это кнопки...",
        Location::TreasureRoom => "Вокруг все блестит и светится.
            \rПовсюду находятся огромное количество разных монет, кубков и медалей.",
        Location::Exit => "Солнце ослепляет тебя. 
            \rТы вдыхаешь свежий воздух.
            \rРядом находится дорога и ты слышишь как подъезжает машина...",
    }
}