use crate::{game::{Action, GameState, Location}, location};

pub fn get_description(location: &Location) -> &'static str {
    match location {
        Location::Entrance => "Ты стоишь перед входом в древнее подземелье. 
            Темнота поглощает свет факела. На стене — надпись: 'Только достойные 
            пройдут дальше'.",
        Location::DarkCave => "Тебя обволакивает давящая темнота. 
            Факел способен осветить лишь пространство в метре от тебя.
            Но даже в такой темноте тебе удается разглядеть три прохода...",
        Location::TrapCorridor => "Ты оказываешься в узком корридоре. 
            На стенах торчит множество ножей, вил и других острых вещей. 
            На полу отчетливл видно, что некоторые камни выше других, как будто это кнопки...",
        Location::TreasureRoom => "Вокруг все блестит и светится.
            Повсюду находятся огромное количество разных монет, кубков и медалей.",
        Location::Exit => "Солнце ослепляет тебя. 
            Ты вдыхаешь свежий воздух.
            Рядом находится дорога и ты слышишь как подъезжает машина...",
    }
}